#include<stdio.h>

int main()
{
    int x[3][3], y[3][3], z[3][3], i, j, k;

    // x ম্যাট্রিক্সের মান ইনপুট নেওয়া
    for(i=0; i<3; i++)
    {
        for(j=0; j<3; j++)
        {
            scanf("%d", &x[i][j]);
        }
    }

    // y ম্যাট্রিক্সের মান ইনপুট নেওয়া
    for(i=0; i<3; i++)
    {
        for(j=0; j<3; j++)
        {
            scanf("%d", &y[i][j]);
        }
    }

    // x ম্যাট্রিক্সের মান প্রিন্ট
    printf("Matrix x = \n");
    for(i=0; i<3; i++)
    {
        for(j=0; j<3; j++)
        {
            printf("%d\t", x[i][j]);
        }
        printf("\n");
    }

    // y ম্যাট্রিক্সের মান প্রিন্ট
    printf("Matrix y = \n");
    for(i=0; i<3; i++)
    {
        for(j=0; j<3; j++)
        {
            printf("%d\t", y[i][j]);
        }
        printf("\n");
    }

    // x এবং y ম্যাট্রিক্সের মান গুন্
    printf("Output Matrix = \n");

    // রেজাল্ট ম্যাট্রিক্স z এর রো বরাবর মান নেয়ার জন্য
    for(i=0; i<3; i++)
    {
         // রেজাল্ট ম্যাট্রিক্স z এর কোলাম বরাবর মান নেয়ার জন্য
        for(j=0; j<3; j++)
        {
            z[i][j] = 0;
            /* x এবং y ম্যাট্রিক্স এর ইনডেক্স অনুসারে রো এবং কোলাম
                                এর গুন্ এর পর প্রতিবার সেই মানগুলো যোগ এর জন্য */
            for(k=0; k<3; k++)
            {
                // z ম্যাট্রিক্স এর মাঝে আউটপুট সেট করা
                z[i][j] += x[i][k] * y[k][j];
            }
            printf("%d\t", z[i][j]);
        }
        printf("\n");
    }

    return 0;
}

