#include <stdio.h>

int main() {

    /* আমরা ফ্লোট ব্যবহার করব যেন ইউজার ক্যালকুলেটরে int আর float
            দুই ধরনের সংখ্যাই দিতে পারে হিসাব নিকাশ করার জন্য */
    float num1, num2, result;

    /* অপারেটর ভ্যারিয়েবল, ইউজার যোগ, বিয়োগ, গুণ, ভাগ যেই সংখ্যা দিবে
            সেটাকে op ভ্যারিয়েবলে স্টোর করব। আর যেহেতু এগুলো স্পেশাল ক্যারেকটার
            বা অপারেটর তাই আমরা এই ভ্যারিয়েবলের ডেটা টাইপ char সেট করেছি */
    char op;

    /* ইউজারের দেওয়া প্রথম নাম্বারটি নিয়ে num1 ভ্যারিয়েবলে বসাচ্ছি */
    printf("Enter first number: ");
    scanf("%f", &num1);

    /* ইউজার যোগ, বিয়োগ, গুণ, ভাগ যেই ক্যারেক্টার দিচ্ছে সেটাকে op ভ্যারিয়েবলে বসাচ্ছি */
    printf("Enter operator (+, -, *, /): ");
    scanf(" %c", &op);

    /* ইউজারের দেওয়া দ্বিতীয় নাম্বারটি নিয়ে num2 ভ্যারিয়েবলে বসাচ্ছি */
    printf("Enter second number: ");
    scanf("%f", &num2);

    // হিসাবের জন্য যেই অপারেটর দেওয়া হবে সেটার ভিত্তিতে হিসাব করার জন্য
    switch (op) { /* যেহেতু উপরে বলেছি যে op ভ্যারিয়েবলে আমরা উক্ত অপারেটরটি রাখব */
        case '+':
            result = num1 + num2;
            printf("Result = %.2f\n", result); /* %.2f কেনো দিয়েছি না বুঝলে অধ্যায় ৭-এর কোডগুলো দেখো */
            break;
        case '-':
            result = num1 - num2;
            printf("Result = %.2f\n", result);
            break;
        case '*':
            result = num1 * num2;
            printf("Result = %.2f\n", result);
            break;
        case '/':
            /* এটা করছি কারণ 0 দ্বারা কোনো সংখ্যাকে ভাগ করা যায় না, তো
                                ইউজার দ্বিতীয় সংখ্যা 0 দিলে প্রোগ্রাম তাকে এরর দিবে। তোমাদের
                                কম্পিউটার বা ফোনে ট্রাই করলেও দেখবে যে একই এরর দিচ্ছে */
            if (num2 == 0) {
                printf("Error: Cannot divide by zero.\n");
            } else {
                result = num1 / num2;
                printf("Result: %.2f\n", result);
            }
            break;
        default:
            /* যদি ইউজার উপরের ৪টা অপারেটর বাদে অন্য কোনো
                                অপারেটর দেয় তাহলে এই এরর দিবে */
            printf("Error: Invalid operator\n");
    }
    return 0;
}
